// DO NOT EDIT. This is code generated via package:intl/generate_localized.dart
// This is a library that provides messages for a ar locale. All the
// messages from the main program should be duplicated here with the same
// function name.

// Ignore issues from commonly used lints in this file.
// ignore_for_file:unnecessary_brace_in_string_interps, unnecessary_new
// ignore_for_file:prefer_single_quotes,comment_references, directives_ordering
// ignore_for_file:annotate_overrides,prefer_generic_function_type_aliases
// ignore_for_file:unused_import, file_names, avoid_escaping_inner_quotes
// ignore_for_file:unnecessary_string_interpolations, unnecessary_string_escapes

import 'package:intl/intl.dart';
import 'package:intl/message_lookup_by_library.dart';

final messages = new MessageLookup();

typedef String MessageIfAbsent(String messageStr, List<dynamic> args);

class MessageLookup extends MessageLookupByLibrary {
  String get localeName => 'ar';

  final messages = _notInlinedMessages(_notInlinedMessages);
  static Map<String, Function> _notInlinedMessages(_) => <String, Function>{
        "aboutUs": MessageLookupByLibrary.simpleMessage("معلومات عنا"),
        "contactUsContent": MessageLookupByLibrary.simpleMessage(
            "نود أن نسمع منك! سواء كان لديك استفسارات، تحتاج إلى دعم، ترغب في مشاركة ملاحظات، أو ببساطة لديك اقتراحات، فإن فريقنا هنا لمساعدتك. يُرجى عدم التردد في التواصل معنا باستخدام النموذج أدناه أو عبر تفاصيل الاتصال المقدمة.\nمعلومات الاتصال:\nالبريد الإلكتروني لدعم العملاء: [support@yourseatapp.com]\nرقم الهاتف: [+123-456-7890]\n\nالملاحظات والاقتراحات:\nنحن نقدر مدخلاتك بشدة! إذا كان لديك أي اقتراحات حول كيفية تحسين تجربتك مع YourSeat، يُرجى مشاركتها في حقل الرسالة في نموذج الاتصال أو إرسالها مباشرة إلى بريدنا الإلكتروني.\n\nتواصل معنا على قنواتنا على وسائل التواصل الاجتماعي للحصول على آخر التحديثات والعروض الترويجية والمزيد:"),
        "hello": MessageLookupByLibrary.simpleMessage("مرحبا"),
        "privacyPolicyContent": MessageLookupByLibrary.simpleMessage(
            "في YourSeat، نحن ملتزمون بحماية خصوصيتك. توضح سياسة الخصوصية هذه كيف نجمع ونستخدم وندعم بياناتك الشخصية عندما تستخدم تطبيق YourSeat للهاتف المحمول. باستخدام التطبيق، فإنك توافق على جمع واستخدام معلوماتك وفقًا لهذه السياسة.\n\n1. كيف نستخدم معلوماتك: تُستخدم المعلومات التي نجمعها منك للأغراض التالية:\n   لتوفير وصيانة التطبيق: لضمان عمل التطبيق بشكل صحيح وتحسين أدائه.\n   لمعالجة المعاملات: التعامل مع المدفوعات لتذاكر السينما والخدمات ذات الصلة.\n   لتقديم توصيات مخصصة: اقتراح أفلام وصالات السينما بناءً على تفضيلاتك وموقعك.\n   للتواصل معك: إرسال إشعارات حول حجوزاتك أو العروض الترويجية أو التحديثات لخدماتنا.\n   لتحسين خدماتنا: تحليل بيانات استخدام التطبيق لتعزيز الميزات وحل المشكلات.\n\n2. كيف نحمي بياناتك: تستخدم Your Seat مجموعة من تدابير الأمان القياسية لحماية معلوماتك الشخصية، بما في ذلك:\n   التشفير: نقوم بتأمين بيانات الدفع ومعلوماتك الشخصية باستخدام بروتوكولات التشفير مثل SSL.\n   قيود الوصول: يمكن فقط للأشخاص المصرح لهم الوصول إلى بياناتك الشخصية.\n   التدقيق المستمر: نقوم بمراجعة ممارسات الأمان لدينا بانتظام لضمان أمان بياناتك.\n   بينما نتخذ كل احتياطاتنا، لا توجد تدابير أمان مضمونة تمامًا، ولا يمكننا ضمان الأمان الكامل لبياناتك.\n\n3. مشاركة البيانات والإفصاح: لا تقوم Your Seat ببيع أو مشاركة معلوماتك الشخصية مع أطراف ثالثة، باستثناء:\n   مقدمي الخدمة: نحن نعمل مع شركاء موثوقين من الأطراف الثالثة (مثل معالجي المدفوعات، ومقدمي خدمات التخزين السحابي) للمساعدة في تقديم خدماتنا.\n   الالتزامات القانونية: قد نكشف عن معلوماتك إذا كان ذلك مطلوبًا بموجب القانون أو استجابة لطلب قانوني صالح (مثل أمر محكمة).\n\n4. حقوقك: لديك الحقوق التالية المتعلقة ببياناتك الشخصية:\n   الوصول: يمكنك طلب نسخة من البيانات الشخصية التي نحتفظ بها عنك.\n   التصحيح: يمكنك طلب تصحيحات أو تحديثات لبياناتك.\n   الحذف: يمكنك طلب حذف بياناتك، وذلك وفقًا للمتطلبات القانونية.\n   إلغاء الاشتراك في التسويق: يمكنك إلغاء الاشتراك من الاتصالات الترويجية من خلال اتباع رابط إلغاء الاشتراك في رسائل البريد الإلكتروني الخاصة بنا أو ضبط إعدادات التطبيق."),
        "signin": MessageLookupByLibrary.simpleMessage("تسجيل الدخول"),
        "termsAndConditionsContent": MessageLookupByLibrary.simpleMessage(
            "1. مسؤوليات المستخدم: باستخدام هذا التطبيق، فإنك توافق على الالتزام بشروط الخدمة الخاصة بنا والتصرف بطريقة محترمة. يُرجى الامتناع عن أي سلوك يعكر تجربة مشاهدة الأفلام للآخرين، مثل التحدث بصوت عالٍ، أو استخدام هاتفك، أو شراء تذاكر للاستخدام غير المصرح به. نحتفظ بالحق في إلغاء وصولك إلى التطبيق إذا تم انتهاك هذه الشروط.\n\n2. إنشاء حساب المستخدم: لإنشاء حساب، ستحتاج إلى تقديم عنوان بريد إلكتروني صالح وكلمة مرور قوية. يُرجى اختيار كلمة مرور يصعب تخمينها وتجنب استخدام معلومات سهلة التعرف. يتم تخزين بيانات حسابك بشكل آمن، وهي متاحة فقط للأشخاص المصرح لهم. الأمان: اختر كلمة مرور قوية تجمع بين الحروف والأرقام والرموز. تجنب استخدام نفس كلمة المرور لعدة حسابات. قم بتمكين التحقق الثنائي (إذا كان متاحًا) لزيادة الأمان. لا تشارك معلومات تسجيل الدخول الخاصة بك مع أي شخص.\n\n3. معالجة المعاملات: يتم معالجة جميع المعاملات بشكل آمن باستخدام [اذكر بوابة الدفع]. نحن نقبل [قائمة طرق الدفع المقبولة، مثل بطاقات الائتمان، بطاقات الخصم، PayPal]. معلومات إضافية: يُرجى التأكد من أن معلومات الدفع الخاصة بك دقيقة ومحدثة. نحتفظ بالحق في إلغاء الطلبات في حالة وجود نشاط احتيالي أو معلومات دفع غير صحيحة. لأي استفسارات أو مخاوف بشأن المدفوعات، يرجى الاتصال بفريق دعم العملاء لدينا.\n\n4. ملكية المحتوى: جميع المحتويات داخل التطبيق، بما في ذلك الصور والنصوص ومقاطع الفيديو والمواد الأخرى، هي ملك لـ [Your Seat] أو المرخصين لها. ما لم يتم الإشارة إلى خلاف ذلك، لا يُسمح لك باستخدام أو إعادة إنتاج أو تعديل أو توزيع أو عرض أي محتوى من التطبيق بدون إذن خطي مسبق.")
      };
}
